In [19]:
import pandas as pd

df = pd.read_csv('student_data.csv')

df.sample(5)

    StudentID     Name  Age     Grade
7           8   Hannah   23  C
2           3  Charlie   21         A
18         19      Sam   21         B
16         17    Quinn   20         C
9          10     Jane   22         B

In [24]:
# Check the shape and info of the DataFrame
print("Shape of DataFrame:", df.shape)
print("Number of rows:", len(df))
print("\nDataFrame info:")
print(df.info())
df.describe

Shape of DataFrame: (19, 4)
Number of rows: 19

DataFrame info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  19 non-null     int64
 1   Name       19 non-null     object
 2   Age        19 non-null     int64
 3   Grade      19 non-null     object
dtypes: int64(2), object(2)
memory usage: 740.0+ bytes
None

<bound method NDFrame.describe of     StudentID     Name  Age     Grade
0           1    Alice   20         A
1           2      Bob   22         B
2           3  Charlie   21         A
3           4    Diana   23         C
4           5    Ethan   20         B
5           6    Fiona   22         A
6           7   George   21         B
7           8   Hannah   23  C
8           9      Ian   20         A
9          10     Jane   22         B
10         11     Kyle   21         C
11         12    Laura   23         A
12         13     Matt   20         B
13         14     Nina   22         C
14         15     Owen   21         A
15         16    Paula   23         B
16         17    Quinn   20         C
17         18   Rachel   22         A
18         19      Sam   21         B>

In [ ]:
myList = [["Sami", 23], ["Ahmed", 25], ["Lina", 22]]
df_new = pd.DataFrame(myList, columns=['Name', 'Age'])
print(df_new)

    Name  Age
0   Sami   23
1  Ahmed   25
2   Lina   22

In [4]:
import pandas as pd

myList2 = [['John Doe', 28], ['Jane Smith', 34], ['Emily Davis', 22]]
df_newwer = pd.DataFrame(myList2, columns=['Name', 'Age'])
print(df_newwer)
print(df_newwer.loc[[0, 2]])

          Name  Age
0     John Doe   28
1   Jane Smith   34
2  Emily Davis   22
          Name  Age
0     John Doe   28
2  Emily Davis   22

In [9]:
# Drop row with label 0 if it exists (avoid KeyError when label not found)
df_newwer.drop(0, inplace=True, errors='ignore')
print(df_newwer)

          Name  Age
1   Jane Smith   34
2  Emily Davis   22

In [13]:
# drop the colomn or edit column contents
# --- IGNORE ---

df_newwer.loc[1, 'Age'] = 25

# ensure 'Age' is numeric before performing arithmetic
df_newwer['Age'] = pd.to_numeric(df_newwer['Age'], errors='coerce')

print(df_newwer)

df_newwer.loc[1:2, 'Age'] += 2
print(df_newwer)
# --- IGNORE ---

          Name  Age
1   Jane Smith   25
2  Emily Davis   22
          Name  Age
1   Jane Smith   27
2  Emily Davis   24

Sort

In [24]:
print(df)
df.sort_values('Age', ascending=False)

    StudentID     Name  Age     Grade
0           1    Alice   20         A
1           2      Bob   22         B
2           3  Charlie   21         A
3           4    Diana   23         C
4           5    Ethan   20         B
5           6    Fiona   22         A
6           7   George   21         B
7           8   Hannah   23  C
8           9      Ian   20         A
9          10     Jane   22         B
10         11     Kyle   21         C
11         12    Laura   23         A
12         13     Matt   20         B
13         14     Nina   22         C
14         15     Owen   21         A
15         16    Paula   23         B
16         17    Quinn   20         C
17         18   Rachel   22         A
18         19      Sam   21         B

    StudentID     Name  Age     Grade
15         16    Paula   23         B
7           8   Hannah   23  C
3           4    Diana   23         C
11         12    Laura   23         A
13         14     Nina   22         C
1           2      Bob   22         B
17         18   Rachel   22         A
9          10     Jane   22         B
5           6    Fiona   22         A
18         19      Sam   21         B
2           3  Charlie   21         A
6           7   George   21         B
14         15     Owen   21         A
10         11     Kyle   21         C
0           1    Alice   20         A
8           9      Ian   20         A
4           5    Ethan   20         B
12         13     Matt   20         B
16         17    Quinn   20         C

In [31]:
mod_age= df.loc[(df['Age'] == 20) & (df['StudentID'] < 17) & (df['StudentID'] < 20)]
print(mod_age)

    StudentID   Name  Age Grade
0           1  Alice   20     A
4           5  Ethan   20     B
8           9    Ian   20     A
12         13   Matt   20     B